* Constrepo

Constrepo (latin) -- buzz

Constrepo is a webapp for generating CASE tool names and features.
software-engineering buzzwords.
Inspiration for this program came from such things as "Code-first Entity Framework"
and "Enterprise Architect".

The main purpose of this program was for me to play around with couchapps to gain
a familiarity with the platform.

This should be online by 12/21/15.

* Time Estimates
** Basic functionality
2.5h
*** Create a "hello world" show function and deploy to ensure software stack is working
    CLOCK: [2014-12-17 Wed 15:59]--[2014-12-17 Wed 16:13] =>  0:14
.25h
*** Design and generate the word list json document
    CLOCK: [2014-12-17 Wed 16:26]--[2014-12-17 Wed 16:31] =>  0:05
    CLOCK: [2014-12-17 Wed 16:16]--[2014-12-17 Wed 16:24] =>  0:08
.5h
*** Write the client-side js to generate the names and tasks using the word list
    CLOCK: [2014-12-19 Fri 00:29]--[2014-12-19 Fri 00:40] =>  0:11
    CLOCK: [2014-12-18 Thu 17:28]--[2014-12-18 Thu 18:00] =>  0:32
    CLOCK: [2014-12-18 Thu 12:03]--[2014-12-18 Thu 12:30] =>  0:27
    CLOCK: [2014-12-18 Thu 00:22]--[2014-12-18 Thu 00:43] =>  0:21
    CLOCK: [2014-12-18 Thu 00:01]--[2014-12-18 Thu 00:17] =>  0:16
    CLOCK: [2014-12-17 Wed 19:28]--[2014-12-17 Wed 19:51] =>  0:23
1h
So I'm 0:39 in and I'm going to have to change directions.
I had decided to move the word selection to the server side to reduce
bandwidth and to avoid giving away the whole word list.
I wrote a show function that selected a random verb from the word list.
However, the same verb was always returned; I believe that this is
because show functions are not allowed to have side effects. In essence,
my page is getting cached.
Thus the only way to do this is to send the user the word list and
have client side js do it.

*** Generalize the task to create generated "selling point" sentences.
    CLOCK: [2014-12-19 Fri 22:51]--[2014-12-19 Fri 23:18] =>  0:27
    CLOCK: [2014-12-19 Fri 22:29]--[2014-12-19 Fri 22:46] =>  0:17
.75h
The time estimate on this is to include figuring out the templating going on
in the scripts ... a little bit of reverse engineering on the sample couchapp.

** Extended functionality
4h
*** Figure out how to do login/logout with evently
    CLOCK: [2014-12-20 Sat 13:53]--[2014-12-20 Sat 14:14] =>  0:21
    CLOCK: [2014-12-20 Sat 13:47]--[2014-12-20 Sat 13:50] =>  0:03
    CLOCK: [2014-12-20 Sat 12:50]--[2014-12-20 Sat 12:55] =>  0:05
2h
*** Add a show function to modify word lists
    CLOCK: [2014-12-23 Tue 20:33]
    CLOCK: [2014-12-23 Tue 16:57]--[2014-12-23 Tue 17:18] =>  0:21
    CLOCK: [2014-12-23 Tue 16:33]--[2014-12-23 Tue 16:51] =>  0:18
    CLOCK: [2014-12-23 Tue 16:08]--[2014-12-23 Tue 16:22] =>  0:14
    CLOCK: [2014-12-23 Tue 07:00]--[2014-12-23 Tue 07:10] =>  0:10
    CLOCK: [2014-12-22 Mon 19:18]--[2014-12-22 Mon 20:21] =>  1:03
    CLOCK: [2014-12-20 Sat 14:14]--[2014-12-20 Sat 14:24] =>  0:10
1.5h
   Just adding this functionality directly into index.html.
   Also, decided to go with the mindmup-editabletable script.
   This partly explains the extra time this took.
   Also did not factor in document rewrite/null case/ownership questions.
   Note to self: figure out what to do with the concurrency problems when
   syncing data between local js and the db.
   
** Make it pretty
2h
*** Add Twitter Bootstrap
1h
*** Find jQuery plugin or something to make the table of words in the word list show function prettier
    CLOCK: [2014-12-23 Tue 15:57]--[2014-12-23 Tue 16:06] =>  0:09
    CLOCK: [2014-12-20 Sat 16:32]--[2014-12-20 Sat 16:50] =>  0:18
    CLOCK: [2014-12-20 Sat 14:24]--[2014-12-20 Sat 14:35] =>  0:11
1h

*** Misc cleanup & formatting
    CLOCK: [2014-12-19 Fri 23:21]--[2014-12-19 Fri 23:23] =>  0:02
1.5h

** Environment Setup + Customization time
   CLOCK: [2014-12-20 Sat 12:55]--[2014-12-20 Sat 13:02] =>  0:07

